app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "subtitle", "content", "author", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save